var data=[];

var dataStr ='1、余生的第一天<br>\
<br>\
导演: 雷米·贝占松<br>\
编剧: 雷米·贝占松<br>\
主演: 雅克·甘布林 / 扎布·布雷特曼 / 皮奥·马麦 / 马克-安德烈·格隆丁 / 黛博拉·弗朗索瓦<br>\
类型: 剧情 / 家庭<br>\
制片国家/地区: 法国<br>\
语言: 法语<br>\
上映日期: 2008-07-23(法国)<br>\
片长: 114分钟<br>\
<br>\
<br>\
2、放牛班的春天<br>\
<br>\
导演: 克里斯托夫·巴拉蒂<br>\
编剧: Georges Chaperot / René Wheeler<br>\
主演: 杰拉尔·朱诺 / 让-巴蒂斯特·莫尼耶 / 弗朗索瓦·贝利昂 / 凯德·麦拉德 / 玛丽·布奈尔 / 更多...<br>\
类型: 剧情 / 音乐<br>\
制片国家/地区: 法国 / 瑞士 / 德国<br>\
语言: 法语<br>\
上映日期: 2004-10-16(中国大陆) / 2004-03-17(法国)<br>\
片长: 97 分钟<br>\
<br>\
<br>\
3、老炮儿<br>\
<br>\
导演: 管虎<br>\
编剧: 管虎 / 董润年<br>\
主演: 冯小刚 / 许晴 / 张涵予 / 刘桦 / 李易峰 / 更多...<br>\
类型: 剧情 / 犯罪<br>\
制片国家/地区: 中国大陆<br>\
语言: 汉语普通话<br>\
上映日期: 2015-12-24(中国大陆) / 2015-09-09(威尼斯电影节)<br>\
片长: 137分钟(中国大陆) / 140分钟(威尼斯电影节版)<br>\
<br>\
<br>\
4、岳父岳母真难当<br>\
<br>\
导演: 菲利普∙德∙肖伏隆<br>\
编剧: Guy Laurent / 菲利普∙德∙肖伏隆<br>\
主演: 克里斯汀·克拉维尔 / 尚塔尔·罗比 / 阿里·阿比唐 / Medi Sadoun / 弗雷德里克·周 / 更多...<br>\
类型: 喜剧 / 家庭<br>\
制片国家/地区: 法国<br>\
语言: 法语<br>\
上映日期: 2014-04-16(法国)<br>\
片长: 97分钟<br>\
<br>\
<br>\
5、你丫闭嘴<br>\
<br>\
导演: 法兰西斯·威柏<br>\
编剧: 法兰西斯·威柏<br>\
主演: 杰拉尔·德帕迪约 / 让·雷诺 / 理查德·贝里 / 安德烈·杜索里埃 / 让-皮埃尔·马洛 / 更多...<br>\
类型: 喜剧 / 犯罪<br>\
制片国家/地区: 法国 / 意大利<br>\
语言: 法语<br>\
上映日期: 2003-10-22<br>\
片长: 85 分钟<br>\
<br>\
<br>\
6、这个杀手不太冷<br>\
<br>\
导演: 吕克·贝松<br>\
编剧: 吕克·贝松<br>\
主演: 让·雷诺 / 娜塔莉·波特曼 / 加里·奥德曼 / 丹尼·爱罗 / 麦温<br>\
类型: 剧情 / 动作 / 犯罪<br>\
制片国家/地区: 法国<br>\
语言: 英语 / 意大利语 / 法语<br>\
上映日期: 1994-09-14(法国)<br>\
片长: 133分钟(国际版) / 110分钟(公映版)<br>\
<br>\
<br>\
7、阿甘正传<br>\
<br>\
导演: 罗伯特·泽米吉斯<br>\
编剧: 艾瑞克·罗斯 / Winston Groom<br>\
主演: 汤姆·汉克斯 / 罗宾·怀特 / 加里·西尼斯 / 麦凯尔泰·威廉逊 / 莎莉·菲尔德 / 更多...<br>\
类型: 剧情 / 爱情<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 1994-06-23(洛杉矶首映) / 1994-07-06(美国)<br>\
片长: 142 分钟<br>\
<br>\
<br>\
8、教父<br>\
<br>\
导演: 弗朗西斯·福特·科波拉<br>\
编剧: 马里奥·普佐 / 弗朗西斯·福特·科波拉<br>\
主演: 马龙·白兰度 / 阿尔·帕西诺 / 詹姆斯·肯恩 / 罗伯特·杜瓦尔 / 黛安·基顿 / 更多...<br>\
类型: 剧情 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 意大利语 / 拉丁语<br>\
上映日期: 1972-03-15(纽约首映) / 1972-03-24(美国)<br>\
片长: 175 分钟<br>\
<br>\
<br>\
9、当幸福来敲门<br>\
<br>\
导演: 加布里尔·穆奇诺<br>\
编剧: 史帝文·康拉德<br>\
主演: 威尔·史密斯 / 贾登·史密斯 / 坦迪·牛顿 / 布莱恩·豪威 / 詹姆斯·凯伦 / 更多...<br>\
类型: 剧情 / 家庭 / 传记<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 粤语<br>\
上映日期: 2008-01-17(中国大陆) / 2006-12-15(美国)<br>\
片长: 117分钟<br>\
<br>\
<br>\
10、触不可及<br>\
<br>\
导演: 奥利维·那卡什 / 艾力克·托兰达<br>\
编剧: 奥利维·那卡什 / 艾力克·托兰达<br>\
主演: 弗朗索瓦·克鲁塞 / 奥玛·赛 / 安乐妮 / 奥黛丽·弗洛特 / 托马斯·索利维斯<br>\
类型: 剧情 / 喜剧<br>\
制片国家/地区: 法国<br>\
语言: 法语<br>\
上映日期: 2011-11-02(法国)<br>\
片长: 112分钟<br>\
<br>\
<br>\
11、V字仇杀队<br>\
<br>\
导演: 詹姆斯·麦克特格<br>\
编剧: 莉莉·沃卓斯基 / 拉娜·沃卓斯基<br>\
主演: 娜塔莉·波特曼 / 雨果·维文 / 鲁珀特·格雷夫斯 / 斯蒂芬·瑞 / 斯蒂芬·弗雷 / 更多...<br>\
类型: 剧情 / 动作 / 科幻 / 惊悚<br>\
制片国家/地区: 美国 / 英国 / 德国<br>\
语言: 英语<br>\
上映日期: 2005-12-11(BNAT电影节) / 2006-03-17(美国)<br>\
片长: 132分钟<br>\
<br>\
<br>\
12、蝴蝶效应<br>\
<br>\
导演: 埃里克·布雷斯 / J.麦基·格鲁伯<br>\
编剧: J.麦基·格鲁伯 / 埃里克·布雷斯<br>\
主演: 阿什顿·库彻 / 艾米·斯马特 / 埃尔登·汉森 / 罗根·勒曼<br>\
类型: 剧情 / 科幻 / 悬疑 / 惊悚<br>\
制片国家/地区: 美国 / 加拿大<br>\
语言: 英语<br>\
上映日期: 2004-01-23(美国)<br>\
<br>\
<br>\
13、饮食男女<br>\
<br>\
导演: 李安<br>\
编剧: 李安 / 王蕙玲 / 詹姆斯·夏慕斯<br>\
主演: 吴倩莲 / 杨贵媚 / 王渝文 / 郎雄 / 张艾嘉 / 更多...<br>\
类型: 剧情 / 家庭<br>\
制片国家/地区: 台湾 / 美国<br>\
语言: 汉语普通话 / 闽南语 / 湖南话<br>\
上映日期: 1994-08-03(美国)<br>\
片长: 124 分钟<br>\
<br>\
<br>\
14、七宗罪<br>\
<br>\
导演: 大卫·芬奇<br>\
编剧: 安德鲁·凯文·沃克<br>\
主演: 摩根·弗里曼 / 布拉德·皮特 / 凯文·史派西 / 格温妮斯·帕特洛 / 安德鲁·凯文·沃克 / 更多...<br>\
类型: 剧情 / 悬疑 / 惊悚 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 葡萄牙语<br>\
上映日期: 1995-09-22(美国)<br>\
片长: 127分钟<br>\
<br>\
<br>\
15、让子弹飞<br>\
<br>\
导演: 姜文<br>\
编剧: 朱苏进 / 述平 / 姜文 / 郭俊立 / 危笑 / 李不空 / 马识途<br>\
主演: 姜文 / 葛优 / 周润发 / 刘嘉玲 / 陈坤 / 更多...<br>\
类型: 剧情 / 喜剧 / 动作 / 西部<br>\
制片国家/地区: 中国大陆 / 香港<br>\
语言: 汉语普通话 / 四川话 / 山西话<br>\
上映日期: 2010-12-16(中国大陆)<br>\
片长: 132分钟<br>\
<br>\
<br>\
16、布达佩斯大饭店<br>\
<br>\
导演: 韦斯·安德森<br>\
编剧: 韦斯·安德森 / 雨果·吉尼斯<br>\
主演: 拉尔夫·费因斯 / 托尼·雷沃罗利 / 艾德里安·布洛迪 / 威廉·达福 / 裘德·洛 / 更多...<br>\
类型: 剧情 / 喜剧<br>\
制片国家/地区: 美国 / 德国 / 英国<br>\
语言: 英语 / 法语 / 德语<br>\
上映日期: 2014-02-06(柏林电影节) / 2014-03-28(美国<br>\
片长: 100分钟<br>\
<br>\
<br>\
17、疯狂动物城<br>\
<br>\
导演: 拜伦·霍华德 / 瑞奇·摩尔 / 杰拉德·布什<br>\
编剧: 杰拉德·布什 / 菲尔·约翰斯顿<br>\
主演: 金妮弗·古德温 / 杰森·贝特曼 / 伊德里斯·艾尔巴 / 珍妮·斯蕾特 / 内特·托伦斯 / 更多...<br>\
类型: 喜剧 / 动作 / 动画 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 挪威语<br>\
上映日期: 2016-03-04(中国大陆/美国)<br>\
片长: 109分钟(中国大陆) / 108分钟<br>\
<br>\
<br>\
18、师父<br>\
<br>\
导演: 徐浩峰<br>\
编剧: 徐浩峰<br>\
主演: 廖凡 / 宋佳 / 蒋雯丽 / 金士杰 / 宋洋 / 更多...<br>\
类型: 剧情 / 动作 / 武侠<br>\
制片国家/地区: 中国大陆<br>\
语言: 汉语普通话<br>\
上映日期: 2015-12-10(中国大陆) / 2015-11-11(台北金马影展)<br>\
片长: 109分钟<br>\
<br>\
<br>\
19、中国合伙人<br>\
<br>\
导演: 陈可辛<br>\
编剧: 周智勇 / 张冀 / 林爱华<br>\
主演: 黄晓明 / 邓超 / 佟大为 / 杜鹃<br>\
类型: 剧情<br>\
制片国家/地区: 中国大陆 / 香港<br>\
语言: 英语 / 汉语普通话<br>\
上映日期: 2013-05-17(中国大陆) / 2013-05-30(香港)<br>\
片长: 112分钟<br>\
<br>\
<br>\
20、天使爱美丽<br>\
<br>\
导演: 让-皮埃尔·热内<br>\
编剧: 吉罗姆·洛朗 / 让-皮埃尔·热内<br>\
主演: 奥黛丽·塔图 / 马修·卡索维茨 / 贾梅尔·杜布兹 / 罗瑞娜·克拉沃塔 / 多米尼克·皮诺 / 更多...<br>\
类型: 喜剧 / 爱情<br>\
制片国家/地区: 法国 / 德国<br>\
语言: 法语 / 俄语<br>\
上映日期: 2001-04-25(法国) / 2001-08-16(德国)<br>\
片长: 122分钟 / 129分钟(法国)<br>\
';
var d = dataStr.split('<br><br><br>')
for (var i = 0; i < d.length; i++) {
	var c = d[i].split('<br><br>');
	data.push({

		img: c[0].replace('、',' ')+'.jpg',
		caption: c[0].split('、')[1],
		desc: c[1]

	});
	console.log(c[0].replace('、',' ')+'.jpg');
}
